/*
1.3.3　假设某个用例程序会进行一系列入栈和出栈的混合栈操作。入栈操作会将整数 0 到 9 按顺序压入栈；出栈操作会打印出返回值。下面哪种序列是不可能产生的？

　　　a. 4 3 2 1 0 9 8 7 6 5

　　　b. 4 6 8 7 5 3 2 9 0 1

　　　c. 2 5 6 7 4 8 9 3 1 0

　　　d. 4 3 2 1 0 5 6 7 8 9

　　　e. 1 2 3 4 5 6 9 8 7 0

　　　f. 0 4 6 5 3 8 1 7 2 9

　　　g. 1 4 7 9 8 6 5 3 0 2

　　　h. 2 1 4 3 6 5 8 7 9 0

感觉哪种都不可能产生，栈的打印应该是对称的
错了，实际上是有可能的
 */

import { Stack } from '../Stack'

it('1.3.3', () => {
  const stack = new Stack()
  for (let i = 0, k = 0; i < 10; ) {
    if (k <= 9 && (Math.random() > 0.5 || stack.isEmpty)) {
      stack.push(k)
      k++
    } else {
      console.log(stack.pop())
      i++
    }
  }
})
